InformationRegisters/СпособыОнлайнОплатыИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СпособыОнлайнОплатыИнтернетМагазина</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОплатыПлатежнойКартой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеСпособаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСпособаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпособыОнлайнОплатыИнтернетМагазина/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ТаблицаСоответствияВидовОплат(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпособыОнлайнОплатыИнтернетМагазина.НаименованиеСпособаОплаты КАК НаименованиеСпособаОплаты,
	|	СпособыОнлайнОплатыИнтернетМагазина.ИдентификаторСпособаОплаты КАК ИдентификаторСпособаОплаты,
	|	СпособыОнлайнОплатыИнтернетМагазина.ВидОплатыПлатежнойКартой КАК ВидОплатыПлатежнойКартой
	|ИЗ
	|	РегистрСведений.СпособыОнлайнОплатыИнтернетМагазина КАК СпособыОнлайнОплатыИнтернетМагазина
	|ГДЕ
	|	СпособыОнлайнОплатыИнтернетМагазина.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПредставлениеСтрокой(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпособыОнлайнОплатыИнтернетМагазина.НаименованиеСпособаОплаты КАК НаименованиеСпособаОплаты
	|ИЗ
	|	РегистрСведений.СпособыОнлайнОплатыИнтернетМагазина КАК СпособыОнлайнОплатыИнтернетМагазина
	|ГДЕ
	|	СпособыОнлайнОплатыИнтернетМагазина.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат СтрСоединить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НаименованиеСпособаОплаты"), ", ");
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#КонецЕсли
